CS-4331/notes/html_output/4 - Flying.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fri 09:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc001d6a">1. Flying</a>
<ul>
<li><a href="#org873a016">1.1. Recent Incident</a>
<ul>
<li><a href="#org028e1a5">1.1.1. Bird Strikes</a></li>
<li><a href="#orgf23996a">1.1.2. Air Force plans to recurit teenage gamers</a></li>
</ul>
</li>
<li><a href="#org091e3be">1.2. Flying a UAV</a>
<ul>
<li><a href="#org210420a">1.2.1. UAV Terminology</a></li>
<li><a href="#org6c3d5ea">1.2.2. Wind</a></li>
<li><a href="#orgdd047ff">1.2.3. Drag</a></li>
<li><a href="#orgf265960">1.2.4. Remote Station</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc001d6a" class="outline-2">
<h2 id="orgc001d6a"><span class="section-number-2">1.</span> Flying</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org873a016" class="outline-3">
<h3 id="org873a016"><span class="section-number-3">1.1.</span> Recent Incident</h3>
<div class="outline-text-3" id="text-1-1">
<p>
On jan 9 outside the palisades fire, SuperScooper Quebec 1 was struck by a civilian drone.
</p>
<ul class="org-ul">
<li>LACoFD would like to remind everyone that flying a drone in the midst of firefighting efforts is a federal crime and punishable by up to 12 months in prison or a fine up to $75,000.</li>
</ul>
</div>
<div id="outline-container-org028e1a5" class="outline-4">
<h4 id="org028e1a5"><span class="section-number-4">1.1.1.</span> Bird Strikes</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Yeah. Watch out. Don&rsquo;t die.
</p>
</div>
</div>
<div id="outline-container-orgf23996a" class="outline-4">
<h4 id="orgf23996a"><span class="section-number-4">1.1.2.</span> Air Force plans to recurit teenage gamers</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Hand-eye coordination or something. I don&rsquo;t really know. Good for drones and stuff.
</p>
</div>
</div>
</div>
<div id="outline-container-org091e3be" class="outline-3">
<h3 id="org091e3be"><span class="section-number-3">1.2.</span> Flying a UAV</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org210420a" class="outline-4">
<h4 id="org210420a"><span class="section-number-4">1.2.1.</span> UAV Terminology</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
There are 4 forces of flight that any aircraft will have to deal with
</p>
<ul class="org-ul">
<li>Lift</li>
<li>Drag</li>
<li>Thrust</li>
<li>Gravity</li>
</ul>

<p>
The terms that are used to describe the 3 axis are the following:
</p>
<ul class="org-ul">
<li>Yaw</li>
<li>Pitch</li>
<li>Roll</li>
</ul>

<p>
Additional Controls:
</p>
<ul class="org-ul">
<li>Trim - buttons in the remote control to help adjust roll, pitch, yaw</li>
<li>Rudder - same as the left stuck, but directly coordinates yaw.</li>
</ul>

<p>
Additional forces
</p>
<ul class="org-ul">
<li>Wind</li>
<li>Angular Momentum (propellers moving, which causes angular momentum)</li>
</ul>

<p>
Force of gravity: \(F_g=mg\), where \(g=9.8 \frac{m}{s^2}=32.2\frac{ft}{s^2}\)
</p>

<p>
What happens when all the propellers spin in the same direction?
</p>
<ul class="org-ul">
<li>It&rsquo;s going to be in a flat spin across the perpindicular axis.</li>
<li>Perpindicular momentum.</li>
</ul>

<p>
Why is the preferred propeller spin directions?
</p>
<ul class="org-ul">
<li>Angular momentum still exists, but because the propellers are in different directions, the angular momentum between each of the propellers essentially cancel out.</li>
<li>Not all propellers are built the same. There could be flaws in one compared to another (despite being made to be almost mirror images.)</li>
</ul>
</div>
</div>
<div id="outline-container-org6c3d5ea" class="outline-4">
<h4 id="org6c3d5ea"><span class="section-number-4">1.2.2.</span> Wind</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Speed direction
</p>
<ul class="org-ul">
<li>Wind makes control more difficult</li>
<li>Wind reduces stability</li>
<li>Wind usually causes battery to be depleted faster</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd047ff" class="outline-4">
<h4 id="orgdd047ff"><span class="section-number-4">1.2.3.</span> Drag</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Drag is the aerodynamic force that opposes an aircrafts motion through the air.
</p>
<ul class="org-ul">
<li>It is a mechanical force</li>
<li>Generated by interaction and contact of a body with liquid or gas.</li>
</ul>

<p>
Drag force <b>F<sub>d</sub></b> always opposes the motion of an object.
</p>
<ul class="org-ul">
<li>\(F_d=\frac{1}{2}C \rho A v^2\)</li>
<li>\(C\) is the drag cooeficent</li>
<li>\(A\) is the area of the object facing the fluid</li>
<li>\(\rho\) is the density of the fluid or gas</li>
</ul>
</div>
</div>
<div id="outline-container-orgf265960" class="outline-4">
<h4 id="orgf265960"><span class="section-number-4">1.2.4.</span> Remote Station</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
There is some special switches:
</p>
<ul class="org-ul">
<li>Power light</li>
<li>Antenna</li>
<li>Landing gear</li>
<li>Flaperon</li>
<li>&#x2026;</li>
</ul>

<p>
They can go from ~$150 to ~$1250 depending on which controller you&rsquo;re looking for.
</p>

<p>
Controls:
</p>
<ul class="org-ul">
<li>Throttle (up/down), Yaw (left/right)</li>
<li>Pitch (up/down), Roll (left/right)</li>
</ul>

<p>
Flight Modes:
</p>
<ul class="org-ul">
<li>Manual (like flying a helicopter)</li>
<li>Attitude (auto-level)</li>
<li>GPS Hold (returns to the quadcopters position once the sticks have been centered)</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-24 Fri 09:46</p>
</div>
</body>
</html>
